espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_msc.h
#if defined(_MSC_PAGELOCK0_MASK) || defined(_MSC_INST_PAGELOCKWORD0_MASK)

/***************************************************************************//**
 * @brief
 *   Set the lockbit for a flash page in order to prevent page writes/erases to
 *   the corresponding page.
 *
 * @param[in] page_number
 *   The index of the page to apply the pagelock to. Must be in the range
 *   [0, (flash_size / page_size) - 1].
 ******************************************************************************/
__STATIC_INLINE void MSC_PageLockSetLocked(uint32_t page_number)
{
#if defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)
  (void)sli_tz_ns_interface_dispatch_simple(
    (sli_tz_simple_veneer_fn)sli_tz_msc_set_pagelock,
    page_number);
#else
  EFM_ASSERT(page_number < (FLASH_SIZE / FLASH_PAGE_SIZE));

  #if defined(_MSC_PAGELOCK0_MASK)
  uint32_t *pagelock_registers = (uint32_t *)&MSC->PAGELOCK0;
  #elif defined(_MSC_INST_PAGELOCKWORD0_MASK)
  uint32_t *pagelock_registers = (uint32_t *)&MSC->INST_PAGELOCKWORD0;
  #endif

  pagelock_registers[page_number / 32] |= (1 << (page_number % 32));
#endif
}

/***************************************************************************//**
 * @brief
 *   Get the value of the lockbit for a flash page.
 *
 * @param[in] page_number
 *   The index of the page to get the lockbit value from. Must be in the range
 *   [0, (flash_size / page_size) - 1].
 *
 * @return
 *   Boolean true if the page is locked, false otherwise.
 ******************************************************************************/
__STATIC_INLINE bool MSC_PageLockGetLocked(uint32_t page_number)
{
#if defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)
  return (bool)sli_tz_ns_interface_dispatch_simple(
    (sli_tz_simple_veneer_fn)sli_tz_msc_get_pagelock,
    page_number);
#else
  EFM_ASSERT(page_number < (FLASH_SIZE / FLASH_PAGE_SIZE));

  #if defined(_MSC_PAGELOCK0_MASK)
  uint32_t *pagelock_registers = (uint32_t *)&MSC->PAGELOCK0;
  #elif defined(_MSC_INST_PAGELOCKWORD0_MASK)
  uint32_t *pagelock_registers = (uint32_t *)&MSC->INST_PAGELOCKWORD0;
  #endif

  return pagelock_registers[page_number / 32] & (1 << (page_number % 32));
#endif
}

#endif // _MSC_PAGELOCK0_MASK || _MSC_INST_PAGELOCKWORD0_MASK

#if defined(_MSC_USERDATASIZE_MASK)

/***************************************************************************//**
 * @brief
 *   Get the size of the user data region in flash.
 *
 * @return
 *   The size of the user data region divided by 256.
 ******************************************************************************/
__STATIC_INLINE uint32_t MSC_UserDataGetSize(void)
{
#if defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)
  return sli_tz_ns_interface_dispatch_simple(
    (sli_tz_simple_veneer_fn)sli_tz_msc_get_userdata_size,
    SLI_TZ_DISPATCH_UNUSED_ARG);
#else
  return MSC->USERDATASIZE;
#endif
}

#endif // _MSC_USERDATASIZE_MASK

#if defined(_MSC_MISCLOCKWORD_MASK)

/***************************************************************************//**
 * @brief
 *   Get the current value of the mass erase and user data page lock word
 *   (MSC_MISCLOCKWORD).
 *
 * @return
 *   The 32-bit value read from the MSC_MISCLOCKWORD register.
 ******************************************************************************/
__STATIC_INLINE uint32_t MSC_MiscLockWordGet(void)
{
#if defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)
  return sli_tz_ns_interface_dispatch_simple(
    (sli_tz_simple_veneer_fn)sli_tz_msc_get_misclockword,
    SLI_TZ_DISPATCH_UNUSED_ARG);
#else
  return MSC->MISCLOCKWORD;
#endif
}

/***************************************************************************//**
 * @brief
 *   Write a value to the mass erase and user data page lock word
 *   (MSC_MISCLOCKWORD).
 *
 * @param[in] value
 *   The 32-bit value to write to the MSC_MISCLOCKWORD register.
 ******************************************************************************/
__STATIC_INLINE void MSC_MiscLockWordSet(uint32_t value)
{
#if defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)
  (void)sli_tz_ns_interface_dispatch_simple(
    (sli_tz_simple_veneer_fn)sli_tz_msc_set_misclockword,
    value);
#else
  MSC->MISCLOCKWORD = value;
#endif
}

#endif // _MSC_USERDATASIZE_MASK

#if !defined(SL_CATALOG_TZ_SECURE_KEY_LIBRARY_NS_PRESENT)

/***************************************************************************//**
 * @brief
 *    Clear one or more pending MSC interrupts.
 *
 * @param[in] flags
 *    Pending MSC interrupt source to clear. Use a bitwise logic OR combination
 *   of valid interrupt flags for the MSC module (MSC_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE void MSC_IntClear(uint32_t flags)
{
#if defined(MSC_HAS_SET_CLEAR)
  MSC->IF_CLR = flags;
#else
  MSC->IFC = flags;
#endif
}

/***************************************************************************//**
 * @brief
 *   Disable one or more MSC interrupts.
 *
 * @param[in] flags
 *   MSC interrupt sources to disable. Use a bitwise logic OR combination of
 *   valid interrupt flags for the MSC module (MSC_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE void MSC_IntDisable(uint32_t flags)
{
#if defined(MSC_HAS_SET_CLEAR)
  MSC->IEN_CLR = flags;
#else
  MSC->IEN &= ~(flags);
#endif
}

/***************************************************************************//**
 * @brief
 *   Enable one or more MSC interrupts.
 *
 * @note
 *   Depending on the use, a pending interrupt may already be set prior to
 *   enabling the interrupt. To ignore a pending interrupt, consider using
 *   MSC_IntClear() prior to enabling the interrupt.
 *
 * @param[in] flags
 *   MSC interrupt sources to enable. Use a bitwise logic OR combination of
 *   valid interrupt flags for the MSC module (MSC_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE void MSC_IntEnable(uint32_t flags)
{
#if defined(MSC_HAS_SET_CLEAR)
  MSC->IEN_SET = flags;
#else
  MSC->IEN |= flags;
#endif
}

/***************************************************************************//**
 * @brief
 *   Get pending MSC interrupt flags.
 *
 * @note
 *   The event bits are not cleared by the use of this function.
 *
 * @return
 *   MSC interrupt sources pending. A bitwise logic OR combination of valid
 *   interrupt flags for the MSC module (MSC_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE uint32_t MSC_IntGet(void)
{
  return MSC->IF;
}

/***************************************************************************//**
 * @brief
 *   Get enabled and pending MSC interrupt flags.
 *   Useful for handling more interrupt sources in the same interrupt handler.
 *
 * @note
 *   Interrupt flags are not cleared by the use of this function.
 *
 * @return
 *   Pending and enabled MSC interrupt sources.
 *   The return value is the bitwise AND of
 *   - the enabled interrupt sources in MSC_IEN and
 *   - the pending interrupt flags MSC_IF
 ******************************************************************************/
__STATIC_INLINE uint32_t MSC_IntGetEnabled(void)
{
  uint32_t ien;

  ien = MSC->IEN;
  return MSC->IF & ien;
}

/***************************************************************************//**
 * @brief
 *   Set one or more pending MSC interrupts from SW.
 *
 * @param[in] flags
 *   MSC interrupt sources to set to pending. Use a bitwise logic OR combination of
 *   valid interrupt flags for the MSC module (MSC_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE void MSC_IntSet(uint32_t flags)
{
#if defined(MSC_HAS_SET_CLEAR)
  MSC->IF_SET = flags;
#else
  MSC->IFS = flags;
#endif
}

#if defined(MSC_IF_CHOF) && defined(MSC_IF_CMOF)
/***************************************************************************//**
 * @brief
 *   Start measuring  the cache hit ratio.
 * @details
 *   Starts performance counters. It is defined inline to
 *   minimize the impact of this code on the measurement itself.
 ******************************************************************************/
__STATIC_INLINE void MSC_StartCacheMeasurement(void)
{
  /* Clear CMOF and CHOF to catch these later. */
  MSC->IFC = MSC_IF_CHOF | MSC_IF_CMOF;

